import { Link } from "react-router-dom"
import { useTranslation } from "react-i18next"

import Subheading from "@/shared/typography/Subheading"
import TextAccent from "@/shared/typography/TextAccent"
import Text0 from "@/shared/typography/Text0"

import { useAppSelector } from "@/redux/hooks"

import { cn } from "@/lib/classNames"

const TermsOfUse = () => {
  const { t } = useTranslation("termsOfUse")

  const scale = useAppSelector((state) => state.scale.value)

  return (
    <div
      className={cn(
        "flex flex-col justify-center items-center gap-6",
        scale && "3xl:gap-[1.5625vw]"
      )}
    >
      <Subheading>
        {t("Условия использования (Terms & Conditions) – Crypton")}
      </Subheading>

      <div
        className={cn(
          "flex flex-col gap-3 max-w-[700px]",
          scale && "3xl:gap-[0.78125vw] 3xl:max-w-[45vw]"
        )}
      >
        <TextAccent className="mt-4">{t("1. Согласие с условиями")}</TextAccent>
        <Text0>
          {t(
            'Добро пожаловать на сайт Crypton (далее "Сайт"), принадлежащий и управляемый Crypton (далее "Компания", "мы", "нас" или "наш").'
          )}
        </Text0>
        <Text0>
          {t(
            'Получая доступ к Сайту и используя его, вы ("Пользователь", "вы" или "ваш") соглашаетесь соблюдать настоящие Условия использования (далее "Условия"). Если вы не согласны с этими Условиями, вы не должны использовать Сайт.'
          )}
        </Text0>

        <TextAccent className="mt-4">{t("2. Изменения в условиях")}</TextAccent>
        <Text0>
          {t(
            "Мы оставляем за собой право изменять эти Условия в любое время. Изменения вступают в силу с момента их публикации на Сайте. Ваше дальнейшее использование Сайта после публикации изменений означает ваше согласие с этими изменениями. Мы рекомендуем вам периодически просматривать настоящие Условия."
          )}
        </Text0>

        <TextAccent className="mt-4">{t("3. Описание сервисов")}</TextAccent>
        <Text0>
          {t(
            "Сайт Crypton предоставляет информацию и ресурсы, связанные с криптовалютами, технологией блокчейн и другими финансовыми технологиями. Это может включать (но не ограничивается) статьи, руководства, анализы рынка, инструменты и другие материалы."
          )}
        </Text0>

        <TextAccent className="mt-4">
          {t("4. Интеллектуальная собственность")}
        </TextAccent>
        <Text0>
          {t(
            "Все материалы, содержащиеся на Сайте, включая, но не ограничиваясь, тексты, графику, логотипы, изображения, программное обеспечение и аудиовизуальные материалы, являются собственностью Компании или ее лицензиаров и защищены законами об авторском праве и других законах об интеллектуальной собственности."
          )}
        </Text0>
        <Text0>
          {t(
            "Вы имеете право использовать материалы Сайта только для личного, некоммерческого использования. Любое иное использование, включая, но не ограничиваясь, копирование, распространение, изменение или создание производных работ, без предварительного письменного согласия Компании строго запрещено."
          )}
        </Text0>

        <TextAccent className="mt-4">
          {t("5. Отказ от ответственности")}
        </TextAccent>
        <Text0>
          {t(
            "Информация, представленная на Сайте, предназначена только для информационных и образовательных целей. Мы не предоставляем финансовые, инвестиционные или профессиональные консультации. Все решения, которые вы принимаете, основываясь на информации, полученной с Сайта, являются вашим личным риском."
          )}
        </Text0>
        <Text0>
          {t(
            "Компания не несет ответственности за любые убытки или ущерб, возникшие в результате использования Сайта или доверия информации, представленной на Сайте."
          )}
        </Text0>
        <Text0>
          {t(
            "Мы не гарантируем, что Сайт будет доступен постоянно, без ошибок или сбоев."
          )}
        </Text0>

        <TextAccent className="mt-4">
          {t("6. Ссылки на сторонние сайты")}
        </TextAccent>
        <Text0>
          {t(
            "Сайт может содержать ссылки на сторонние сайты, которые не контролируются Компанией. Мы не несем ответственности за содержание, точность или политику конфиденциальности этих сайтов. Размещение ссылок не означает одобрения этих сайтов со стороны Компании."
          )}
        </Text0>

        <TextAccent className="mt-4">
          {t("7. Ограничение ответственности")}
        </TextAccent>
        <Text0>
          {t(
            "В максимальной степени, разрешенной законом, Компания не несет ответственности за любые прямые, косвенные, случайные, специальные или косвенные убытки, возникшие в результате использования Сайта или невозможности его использования."
          )}
        </Text0>

        <TextAccent className="mt-4">{t("8. Возмещение убытков")}</TextAccent>
        <Text0>
          {t(
            "Вы соглашаетесь возмещать ущерб, защищать и ограждать Компанию, ее аффилированных лиц, должностных лиц, директоров, сотрудников, агентов и поставщиков от любых убытков, ущерба, ответственности, претензий или требований, включая разумные гонорары адвокатов, которые возникают из-за вашего использования Сайта или нарушения настоящих Условий."
          )}
        </Text0>

        <TextAccent className="mt-4">{t("9. Применимое право")}</TextAccent>
        <Text0>
          {t(
            "Настоящие Условия регулируются и толкуются в соответствии с законами. Любые споры, возникающие в связи с настоящими Условиями, подлежат рассмотрению в судах."
          )}
        </Text0>

        <TextAccent className="mt-4">{t("10. Контакты")}</TextAccent>
        <Text0 className="inline">
          {t(
            "Если у вас есть какие-либо вопросы или комментарии относительно этих Условий, свяжитесь с нами по адресу:"
          )}{" "}
          <a
            href="mailto:help@crypton.xyz"
            className="w-fit underline-offset-4 underline hover:opacity-80 inline"
          >
            help@crypton.xyz
          </a>
        </Text0>

        <TextAccent className="mt-4">{t("11. Прочие положения")}</TextAccent>
        <ul className="list-disc">
          <li className="ml-4">
            <Text0>
              {t(
                "Настоящие Условия представляют собой полное соглашение между вами и Компанией в отношении использования Сайта."
              )}
            </Text0>
          </li>
          <li className="ml-4">
            <Text0>
              {t(
                "Если какое-либо положение настоящих Условий будет признано недействительным или не имеющим законной силы, остальные положения остаются в силе."
              )}
            </Text0>
          </li>
          <li className="ml-4">
            <Text0>
              {t(
                "Отказ от права на действие в связи с нарушением настоящих Условий не означает отказ от права на действие в связи с последующими нарушениями."
              )}
            </Text0>
          </li>
        </ul>
      </div>

      <Link to={"/"} className="underline underline-offset-4 hover:opacity-80">
        <Text0>{t("Вернуться на главную")}</Text0>
      </Link>
    </div>
  )
}

export default TermsOfUse
